import { useState } from "react";
import Tusik from "./tusik";

const data = {
  'אישי (ת"ש, מין, כלכלה)': {
    "יציאות ורענונים":
      "לקוח במילואים ראשונים - פנה למפקד. לקוח חוזר - פנה ישירות לקסנר.",
    "מענקים ותגמולים":
      "טרם התקבלה החלטה בנידון. המתן למאי בשנה העוקבת או הטרד את מוקד המילואים 1111.",
    "עד מתי אוקטובר 23": "כל התשובות נכונות.",
    "מתי מגיע האוכל?": "אחי, הרגע סיימתם את ההמבורגר מהתרומה.",
    "שעות שינה": "כל ההקצאות הלכו לשלו, המעט שנשאר נמסר לפישר.",
    "פנויים פנויות": "פרטים אצל פלמן.",
    "דרושות גרושות": "פרטים אצל מרצי.",
  },
  אפסנאות: {
    "ציוד טקטי": 'פנה לחמ"ל האזרחי הקרוב למקום מגוריך',
    בלאי: "פנייתך התקבלה.",
    "ציוד חורף": "אם הינך פחות ממידה ממ - איחלתי לחייל בהצלחה.",
    "לא החתימו אותי": "נשמע אמין.",
    כביסה:
      "אם בקשתך התקבלה עד 15.11 - פנה למכבסת עאוני, לאחר מכן - פנה לשרי. *אם לא התקלחת מיום הגעתך מהבית או אם שמך משה - אנא השלך את הבגדים לצפרדע הקרובה.",
  },
  נשקייה: {
    "משאית טילי לאו": "המשאית בגדוד, פורקים אותה ונחלק לפלוגות.",
    "אפשר לחתום על m16?":
      "לנוחיותך, הנשקייה פתוחה בימים א-ה בין השעות 1200-1201, בתיאום מראש.",
    "נשק שמאלי": "לא צריכה להיות בעיה.",
    "מה זה בורסייט?": "שאל את המטוליסט הצעיר הקרוב למקום מגוריך.",
    "אישור נשק":
      'לנוחיותך, סרטון קצר (שעה וחצי) בנושא ע"י שקד קיים ביוטיוב הקרוב למקום מגוריך.',
  },
  "בינוי ותשתית": {
    "אסלה שבורה": "פתח קריאה נוספת במוקד 1-800-מרסי",
    "מים חמים": "המתן חצי שעה להגעת מים חמים, הבן את הרמז ותתקלח עם מה שיש.",
    "אינטרנט ו- wifi": "פנייתך בטיפול.",
    "מלכודות זבובים": "תגיד תודה שאתה לא בעלמה.",
  },
  "ציוד תרומות": {
    "מטען נייד": "אחי, ידעת שאפשר להטעין את המטען הזה?",
    "כזה לא קיבלתי":
      "פעם ראשונה שאני שומע את זה. פנה לליבו הרחום של גלעדי ( עדיף לפני יציאה שלו הביתה).",
    "יש כזה בטקטי? / יש כזה בתרמי?": 'פתח קריאה במוקד החמ"ל האזרחי.',
    "זה חד פעמי?": "תתקדם.",
  },
  מבצעי:
    "המוקד סגור כעת. פנה למחלקה המתאימה ותן לנו להתעסק בדברים החשובים באמת.",
};

export default function App() {
  const [isOpe, setIsOpe] = useState(false);
  const [obj, setObj] = useState(null);
  function ope(a) {
    setIsOpe(true);
    setObj(a);
  }
  return (
    <div className="app">
      {isOpe ? (
        <Tusik o={obj}></Tusik>
      ) : (
        <div className="main-container">
          <h1>קריאות שירות מפל"ג ב'</h1>
          <div>
            ברוכים הבאים! אפליקציה זו נועדה לעיסוק בתפל בלבד, אם רצונך לעסוק
            בעיקר - אנא חזור ל- call of duty או לקו הראשון.
          </div>

          <div>
            <h2>סוג השירות המבוקש:</h2>
            <div>
              {Object.keys(data).map((a, i) => (
                <div
                  className="clickable"
                  key={i}
                  onClick={() => {
                    ope(data[a]);
                  }}
                >
                  {a}
                </div>
              ))}
            </div>
          </div>
        </div>
      )}
    </div>
  );
}
